old_projects/Kelvin-Gelmgoltz/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

	movingWall1
    {
        type            fixedValue;
        value           uniform (-1 0 0);
    }

    right
     { 
           type            cyclic;
      }

     left
     { 
           type            cyclic;
      }

	right1
     { 
           type            cyclic;
      }

     left1
     { 
           type            cyclic;
      }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
